In [1]:
import pandas as pd

In [2]:
travel_df = pd.read_csv('data/world_cities.csv')

In [3]:
travel_df

     Unnamed: 0 City / Urban area     Country  Population  Land area (in sqKm)
0             0      Buenos Aires   Argentina    11200000                 2266
1             1         Melbourne   Australia     3162000                 2080
2             2            Sydney   Australia     3502000                 1687
3             3          Brisbane   Australia     1508000                 1603
4             4             Perth   Australia     1177000                  964
..          ...               ...         ...         ...                  ...
244         245            Canton         USA      267000                  372
245         246           Spokane         USA      335000                  371
246         247          Tashkent  Uzbekistan     2200000                  531
247         248  Ho Chi Minh City     Vietnam     4900000                  518
248         249            Harare    Zimbabwe     1750000                  712

[249 rows x 5 columns]

In [4]:
travel_df['Country'].unique()

array(['Argentina', 'Australia', 'Austria', 'Azerbaijan', 'Belgium',
       'Brazil', 'Cambodia', 'Canada', 'Chile', 'China', 'Colombia',
       'Congo', 'Denmark', 'Ecuador', 'Egypt', 'Finland', 'France',
       'Germany', 'Ghana', 'Greece', 'Hungary', 'India', 'Indonesia',
       'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy', 'Japan', 'Kuwait',
       'Lebanon', 'Malaysia', 'Mexico', 'Netherlands', 'New Zealand',
       'Nigeria', 'Pakistan', 'Peru', 'Philippines', 'Poland', 'Portugal',
       'Puerto Rico', 'Russia', 'Saudi', 'Saudi Arabia', 'Singapore',
       'South Africa', 'South Korea', 'Spain', 'Sudan', 'Sweden',
       'Taiwan', 'Thailand', 'Turkey', 'UAE', 'UK', 'Ukraine', 'USA',
       'Uzbekistan', 'Vietnam', 'Zimbabwe'], dtype=object)

In [8]:
travel_df['Country'].value_counts()

USA         105
France       15
Brazil       10
Canada        9
Germany       8
           ...
Greece        1
Malaysia      1
Ecuador       1
Hungary       1
Cambodia      1
Name: Country, Length: 61, dtype: int64

In [9]:
travel_df['City / Urban area'].value_counts()

Flint         1
Mobile        1
Providence    1
Vienna        1
Sao Paulo     1
             ..
Ankara        1
Dublin        1
Tel Aviv      1
Albany        1
Jackson       1
Name: City / Urban area, Length: 249, dtype: int64

In [12]:
((travel_df['Population'] / travel_df['Land area (in sqKm)']) > 10000).value_counts()

False    230
True      19
dtype: int64

In [13]:
(travel_df['Population'] / travel_df['Land area (in sqKm)']).describe()

count      249.000000
mean      3285.489898
std       4124.363261
min        329.284750
25%        863.793103
50%       1535.234899
75%       3858.024691
max      29648.760331
dtype: float64

In [16]:
travel_df["destiny"] = (travel_df['Population'] / travel_df['Land area (in sqKm)'])

In [19]:
travel_df.sort_values(by='destiny')

,Unnamed: 0,City / Urban area,Country,Population,Land area (in sqKm),destiny
196,197,Barnstable Town,USA,244000,741,329.284750
220,221,Hickory,USA,188000,546,344.322344
57,57,Pau,France,181000,450,402.222222
223,224,Asheville,USA,222000,536,414.179104
194,195,Chattanooga,USA,344000,751,458.055925
...,...,...,...,...,...,...
34,34,Shenzhen,China,8000000,466,17167.381974
99,99,Lagos,Nigeria,13400000,738,18157.181572
101,101,Karachi,Pakistan,9800000,518,18918.918919
74,74,Kolkata,India,12700000,531,23917.137476
75,75,Mumbai,India,14350000,484,29648.760331

In [20]:
country = travel_df['Country'].value_counts()

In [21]:
print(country[country == 4])

Italy    4
Name: Country, dtype: int64